---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningWarning
source: html/57c329ed-ad63-7a05-b833-f5eec7e327da.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningWarning Property

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCurtainPanelInOpeningWarning { get; }
```